SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFM32PG28/Include/efm32pg28_vdac.h
/* Bit fields for VDAC CFG */
#define _VDAC_CFG_RESETVALUE                    0x20000000UL                            /**< Default value for VDAC_CFG                  */
#define _VDAC_CFG_MASK                          0xFF7F3FBFUL                            /**< Mask for VDAC_CFG                           */
#define VDAC_CFG_DIFF                           (0x1UL << 0)                            /**< Differential Mode                           */
#define _VDAC_CFG_DIFF_SHIFT                    0                                       /**< Shift value for VDAC_DIFF                   */
#define _VDAC_CFG_DIFF_MASK                     0x1UL                                   /**< Bit mask for VDAC_DIFF                      */
#define _VDAC_CFG_DIFF_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for VDAC_CFG                   */
#define _VDAC_CFG_DIFF_SINGLEENDED              0x00000000UL                            /**< Mode SINGLEENDED for VDAC_CFG               */
#define _VDAC_CFG_DIFF_DIFFERENTIAL             0x00000001UL                            /**< Mode DIFFERENTIAL for VDAC_CFG              */
#define VDAC_CFG_DIFF_DEFAULT                   (_VDAC_CFG_DIFF_DEFAULT << 0)           /**< Shifted mode DEFAULT for VDAC_CFG           */
#define VDAC_CFG_DIFF_SINGLEENDED               (_VDAC_CFG_DIFF_SINGLEENDED << 0)       /**< Shifted mode SINGLEENDED for VDAC_CFG       */
#define VDAC_CFG_DIFF_DIFFERENTIAL              (_VDAC_CFG_DIFF_DIFFERENTIAL << 0)      /**< Shifted mode DIFFERENTIAL for VDAC_CFG      */
#define VDAC_CFG_SINEMODE                       (0x1UL << 1)                            /**< Sine Mode                                   */
#define _VDAC_CFG_SINEMODE_SHIFT                1                                       /**< Shift value for VDAC_SINEMODE               */
#define _VDAC_CFG_SINEMODE_MASK                 0x2UL                                   /**< Bit mask for VDAC_SINEMODE                  */
#define _VDAC_CFG_SINEMODE_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for VDAC_CFG                   */
#define _VDAC_CFG_SINEMODE_DISSINEMODE          0x00000000UL                            /**< Mode DISSINEMODE for VDAC_CFG               */
#define _VDAC_CFG_SINEMODE_ENSINEMODE           0x00000001UL                            /**< Mode ENSINEMODE for VDAC_CFG                */
#define VDAC_CFG_SINEMODE_DEFAULT               (_VDAC_CFG_SINEMODE_DEFAULT << 1)       /**< Shifted mode DEFAULT for VDAC_CFG           */
#define VDAC_CFG_SINEMODE_DISSINEMODE           (_VDAC_CFG_SINEMODE_DISSINEMODE << 1)   /**< Shifted mode DISSINEMODE for VDAC_CFG       */
#define VDAC_CFG_SINEMODE_ENSINEMODE            (_VDAC_CFG_SINEMODE_ENSINEMODE << 1)    /**< Shifted mode ENSINEMODE for VDAC_CFG        */
#define VDAC_CFG_SINERESET                      (0x1UL << 2)                            /**< Sine Wave Reset When inactive               */
#define _VDAC_CFG_SINERESET_SHIFT               2                                       /**< Shift value for VDAC_SINERESET              */
#define _VDAC_CFG_SINERESET_MASK                0x4UL                                   /**< Bit mask for VDAC_SINERESET                 */
#define _VDAC_CFG_SINERESET_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for VDAC_CFG                   */
#define VDAC_CFG_SINERESET_DEFAULT              (_VDAC_CFG_SINERESET_DEFAULT << 2)      /**< Shifted mode DEFAULT for VDAC_CFG           */
#define VDAC_CFG_CH0PRESCRST                    (0x1UL << 3)                            /**< Channel 0 Start Reset Prescaler             */
#define _VDAC_CFG_CH0PRESCRST_SHIFT             3                                       /**< Shift value for VDAC_CH0PRESCRST            */
#define _VDAC_CFG_CH0PRESCRST_MASK              0x8UL                                   /**< Bit mask for VDAC_CH0PRESCRST               */
#define _VDAC_CFG_CH0PRESCRST_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for VDAC_CFG                   */
#define _VDAC_CFG_CH0PRESCRST_NORESETPRESC      0x00000000UL                            /**< Mode NORESETPRESC for VDAC_CFG              */
#define _VDAC_CFG_CH0PRESCRST_RESETPRESC        0x00000001UL                            /**< Mode RESETPRESC for VDAC_CFG                */
#define VDAC_CFG_CH0PRESCRST_DEFAULT            (_VDAC_CFG_CH0PRESCRST_DEFAULT << 3)    /**< Shifted mode DEFAULT for VDAC_CFG           */
#define VDAC_CFG_CH0PRESCRST_NORESETPRESC       (_VDAC_CFG_CH0PRESCRST_NORESETPRESC << 3) /**< Shifted mode NORESETPRESC for VDAC_CFG      */
#define VDAC_CFG_CH0PRESCRST_RESETPRESC         (_VDAC_CFG_CH0PRESCRST_RESETPRESC << 3) /**< Shifted mode RESETPRESC for VDAC_CFG        */
#define _VDAC_CFG_REFRSEL_SHIFT                 4                                       /**< Shift value for VDAC_REFRSEL                */
#define _VDAC_CFG_REFRSEL_MASK                  0x30UL                                  /**< Bit mask for VDAC_REFRSEL                   */
#define _VDAC_CFG_REFRSEL_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for VDAC_CFG                   */
#define _VDAC_CFG_REFRSEL_V125                  0x00000000UL                            /**< Mode V125 for VDAC_CFG                      */
#define _VDAC_CFG_REFRSEL_V25                   0x00000001UL                            /**< Mode V25 for VDAC_CFG                       */
#define _VDAC_CFG_REFRSEL_VDD                   0x00000002UL                            /**< Mode VDD for VDAC_CFG                       */
#define _VDAC_CFG_REFRSEL_EXT                   0x00000003UL                            /**< Mode EXT for VDAC_CFG                       */
#define VDAC_CFG_REFRSEL_DEFAULT                (_VDAC_CFG_REFRSEL_DEFAULT << 4)        /**< Shifted mode DEFAULT for VDAC_CFG           */
#define VDAC_CFG_REFRSEL_V125                   (_VDAC_CFG_REFRSEL_V125 << 4)           /**< Shifted mode V125 for VDAC_CFG              */
#define VDAC_CFG_REFRSEL_V25                    (_VDAC_CFG_REFRSEL_V25 << 4)            /**< Shifted mode V25 for VDAC_CFG               */
#define VDAC_CFG_REFRSEL_VDD                    (_VDAC_CFG_REFRSEL_VDD << 4)            /**< Shifted mode VDD for VDAC_CFG               */
#define VDAC_CFG_REFRSEL_EXT                    (_VDAC_CFG_REFRSEL_EXT << 4)            /**< Shifted mode EXT for VDAC_CFG               */
#define _VDAC_CFG_PRESC_SHIFT                   7                                       /**< Shift value for VDAC_PRESC                  */
#define _VDAC_CFG_PRESC_MASK                    0x3F80UL                                /**< Bit mask for VDAC_PRESC                     */
#define _VDAC_CFG_PRESC_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for VDAC_CFG                   */
#define VDAC_CFG_PRESC_DEFAULT                  (_VDAC_CFG_PRESC_DEFAULT << 7)          /**< Shifted mode DEFAULT for VDAC_CFG           */
#define _VDAC_CFG_TIMEROVRFLOWPERIOD_SHIFT      16                                      /**< Shift value for VDAC_TIMEROVRFLOWPERIOD     */
#define _VDAC_CFG_TIMEROVRFLOWPERIOD_MASK       0x70000UL                               /**< Bit mask for VDAC_TIMEROVRFLOWPERIOD        */
#define _VDAC_CFG_TIMEROVRFLOWPERIOD_DEFAULT    0x00000000UL                            /**< Mode DEFAULT for VDAC_CFG                   */
#define _VDAC_CFG_TIMEROVRFLOWPERIOD_CYCLES2    0x00000000UL                            /**< Mode CYCLES2 for VDAC_CFG                   */
#define _VDAC_CFG_TIMEROVRFLOWPERIOD_CYCLES4    0x00000001UL                            /**< Mode CYCLES4 for VDAC_CFG                   */
#define _VDAC_CFG_TIMEROVRFLOWPERIOD_CYCLES8    0x00000002UL                            /**< Mode CYCLES8 for VDAC_CFG                   */
#define _VDAC_CFG_TIMEROVRFLOWPERIOD_CYCLES16   0x00000003UL                            /**< Mode CYCLES16 for VDAC_CFG                  */
#define _VDAC_CFG_TIMEROVRFLOWPERIOD_CYCLES32   0x00000004UL                            /**< Mode CYCLES32 for VDAC_CFG                  */
#define _VDAC_CFG_TIMEROVRFLOWPERIOD_CYCLES64   0x00000005UL                            /**< Mode CYCLES64 for VDAC_CFG                  */
#define VDAC_CFG_TIMEROVRFLOWPERIOD_DEFAULT     (_VDAC_CFG_TIMEROVRFLOWPERIOD_DEFAULT << 16) /**< Shifted mode DEFAULT for VDAC_CFG           */
#define VDAC_CFG_TIMEROVRFLOWPERIOD_CYCLES2     (_VDAC_CFG_TIMEROVRFLOWPERIOD_CYCLES2 << 16) /**< Shifted mode CYCLES2 for VDAC_CFG           */
#define VDAC_CFG_TIMEROVRFLOWPERIOD_CYCLES4     (_VDAC_CFG_TIMEROVRFLOWPERIOD_CYCLES4 << 16) /**< Shifted mode CYCLES4 for VDAC_CFG           */
#define VDAC_CFG_TIMEROVRFLOWPERIOD_CYCLES8     (_VDAC_CFG_TIMEROVRFLOWPERIOD_CYCLES8 << 16) /**< Shifted mode CYCLES8 for VDAC_CFG           */
#define VDAC_CFG_TIMEROVRFLOWPERIOD_CYCLES16    (_VDAC_CFG_TIMEROVRFLOWPERIOD_CYCLES16 << 16) /**< Shifted mode CYCLES16 for VDAC_CFG          */
#define VDAC_CFG_TIMEROVRFLOWPERIOD_CYCLES32    (_VDAC_CFG_TIMEROVRFLOWPERIOD_CYCLES32 << 16) /**< Shifted mode CYCLES32 for VDAC_CFG          */
#define VDAC_CFG_TIMEROVRFLOWPERIOD_CYCLES64    (_VDAC_CFG_TIMEROVRFLOWPERIOD_CYCLES64 << 16) /**< Shifted mode CYCLES64 for VDAC_CFG          */
#define VDAC_CFG_SINEMODEPRS                    (0x1UL << 19)                           /**< Sinemode prs                                */
#define _VDAC_CFG_SINEMODEPRS_SHIFT             19                                      /**< Shift value for VDAC_SINEMODEPRS            */
#define _VDAC_CFG_SINEMODEPRS_MASK              0x80000UL                               /**< Bit mask for VDAC_SINEMODEPRS               */
#define _VDAC_CFG_SINEMODEPRS_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for VDAC_CFG                   */
#define _VDAC_CFG_SINEMODEPRS_DISSINEMODEPRS    0x00000000UL                            /**< Mode DISSINEMODEPRS for VDAC_CFG            */
#define _VDAC_CFG_SINEMODEPRS_ENSINEMODEPRS     0x00000001UL                            /**< Mode ENSINEMODEPRS for VDAC_CFG             */
#define VDAC_CFG_SINEMODEPRS_DEFAULT            (_VDAC_CFG_SINEMODEPRS_DEFAULT << 19)   /**< Shifted mode DEFAULT for VDAC_CFG           */
#define VDAC_CFG_SINEMODEPRS_DISSINEMODEPRS     (_VDAC_CFG_SINEMODEPRS_DISSINEMODEPRS << 19) /**< Shifted mode DISSINEMODEPRS for VDAC_CFG    */
#define VDAC_CFG_SINEMODEPRS_ENSINEMODEPRS      (_VDAC_CFG_SINEMODEPRS_ENSINEMODEPRS << 19) /**< Shifted mode ENSINEMODEPRS for VDAC_CFG     */
#define _VDAC_CFG_REFRESHPERIOD_SHIFT           20                                      /**< Shift value for VDAC_REFRESHPERIOD          */
#define _VDAC_CFG_REFRESHPERIOD_MASK            0x700000UL                              /**< Bit mask for VDAC_REFRESHPERIOD             */
#define _VDAC_CFG_REFRESHPERIOD_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for VDAC_CFG                   */
#define _VDAC_CFG_REFRESHPERIOD_CYCLES2         0x00000000UL                            /**< Mode CYCLES2 for VDAC_CFG                   */
#define _VDAC_CFG_REFRESHPERIOD_CYCLES4         0x00000001UL                            /**< Mode CYCLES4 for VDAC_CFG                   */
#define _VDAC_CFG_REFRESHPERIOD_CYCLES8         0x00000002UL                            /**< Mode CYCLES8 for VDAC_CFG                   */
#define _VDAC_CFG_REFRESHPERIOD_CYCLES16        0x00000003UL                            /**< Mode CYCLES16 for VDAC_CFG                  */
#define _VDAC_CFG_REFRESHPERIOD_CYCLES32        0x00000004UL                            /**< Mode CYCLES32 for VDAC_CFG                  */
#define _VDAC_CFG_REFRESHPERIOD_CYCLES64        0x00000005UL                            /**< Mode CYCLES64 for VDAC_CFG                  */
#define _VDAC_CFG_REFRESHPERIOD_CYCLES128       0x00000006UL                            /**< Mode CYCLES128 for VDAC_CFG                 */
#define _VDAC_CFG_REFRESHPERIOD_CYCLES256       0x00000007UL                            /**< Mode CYCLES256 for VDAC_CFG                 */
#define VDAC_CFG_REFRESHPERIOD_DEFAULT          (_VDAC_CFG_REFRESHPERIOD_DEFAULT << 20) /**< Shifted mode DEFAULT for VDAC_CFG           */
#define VDAC_CFG_REFRESHPERIOD_CYCLES2          (_VDAC_CFG_REFRESHPERIOD_CYCLES2 << 20) /**< Shifted mode CYCLES2 for VDAC_CFG           */
#define VDAC_CFG_REFRESHPERIOD_CYCLES4          (_VDAC_CFG_REFRESHPERIOD_CYCLES4 << 20) /**< Shifted mode CYCLES4 for VDAC_CFG           */
#define VDAC_CFG_REFRESHPERIOD_CYCLES8          (_VDAC_CFG_REFRESHPERIOD_CYCLES8 << 20) /**< Shifted mode CYCLES8 for VDAC_CFG           */
#define VDAC_CFG_REFRESHPERIOD_CYCLES16         (_VDAC_CFG_REFRESHPERIOD_CYCLES16 << 20) /**< Shifted mode CYCLES16 for VDAC_CFG          */
#define VDAC_CFG_REFRESHPERIOD_CYCLES32         (_VDAC_CFG_REFRESHPERIOD_CYCLES32 << 20) /**< Shifted mode CYCLES32 for VDAC_CFG          */
#define VDAC_CFG_REFRESHPERIOD_CYCLES64         (_VDAC_CFG_REFRESHPERIOD_CYCLES64 << 20) /**< Shifted mode CYCLES64 for VDAC_CFG          */
#define VDAC_CFG_REFRESHPERIOD_CYCLES128        (_VDAC_CFG_REFRESHPERIOD_CYCLES128 << 20) /**< Shifted mode CYCLES128 for VDAC_CFG         */
#define VDAC_CFG_REFRESHPERIOD_CYCLES256        (_VDAC_CFG_REFRESHPERIOD_CYCLES256 << 20) /**< Shifted mode CYCLES256 for VDAC_CFG         */
#define VDAC_CFG_BIASKEEPWARM                   (0x1UL << 24)                           /**< Bias Keepwarm Mode Enable                   */
#define _VDAC_CFG_BIASKEEPWARM_SHIFT            24                                      /**< Shift value for VDAC_BIASKEEPWARM           */
#define _VDAC_CFG_BIASKEEPWARM_MASK             0x1000000UL                             /**< Bit mask for VDAC_BIASKEEPWARM              */
#define _VDAC_CFG_BIASKEEPWARM_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for VDAC_CFG                   */
#define VDAC_CFG_BIASKEEPWARM_DEFAULT           (_VDAC_CFG_BIASKEEPWARM_DEFAULT << 24)  /**< Shifted mode DEFAULT for VDAC_CFG           */
#define VDAC_CFG_DMAWU                          (0x1UL << 25)                           /**< VDAC DMA Wakeup                             */
#define _VDAC_CFG_DMAWU_SHIFT                   25                                      /**< Shift value for VDAC_DMAWU                  */
#define _VDAC_CFG_DMAWU_MASK                    0x2000000UL                             /**< Bit mask for VDAC_DMAWU                     */
#define _VDAC_CFG_DMAWU_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for VDAC_CFG                   */
#define VDAC_CFG_DMAWU_DEFAULT                  (_VDAC_CFG_DMAWU_DEFAULT << 25)         /**< Shifted mode DEFAULT for VDAC_CFG           */
#define VDAC_CFG_ONDEMANDCLK                    (0x1UL << 26)                           /**< Always allow clk_dac                        */
#define _VDAC_CFG_ONDEMANDCLK_SHIFT             26                                      /**< Shift value for VDAC_ONDEMANDCLK            */
#define _VDAC_CFG_ONDEMANDCLK_MASK              0x4000000UL                             /**< Bit mask for VDAC_ONDEMANDCLK               */
#define _VDAC_CFG_ONDEMANDCLK_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for VDAC_CFG                   */
#define VDAC_CFG_ONDEMANDCLK_DEFAULT            (_VDAC_CFG_ONDEMANDCLK_DEFAULT << 26)   /**< Shifted mode DEFAULT for VDAC_CFG           */
#define VDAC_CFG_DBGHALT                        (0x1UL << 27)                           /**< Debug Halt                                  */
#define _VDAC_CFG_DBGHALT_SHIFT                 27                                      /**< Shift value for VDAC_DBGHALT                */
#define _VDAC_CFG_DBGHALT_MASK                  0x8000000UL                             /**< Bit mask for VDAC_DBGHALT                   */
#define _VDAC_CFG_DBGHALT_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for VDAC_CFG                   */
#define _VDAC_CFG_DBGHALT_NORMAL                0x00000000UL                            /**< Mode NORMAL for VDAC_CFG                    */
#define _VDAC_CFG_DBGHALT_HALT                  0x00000001UL                            /**< Mode HALT for VDAC_CFG                      */
#define VDAC_CFG_DBGHALT_DEFAULT                (_VDAC_CFG_DBGHALT_DEFAULT << 27)       /**< Shifted mode DEFAULT for VDAC_CFG           */
#define VDAC_CFG_DBGHALT_NORMAL                 (_VDAC_CFG_DBGHALT_NORMAL << 27)        /**< Shifted mode NORMAL for VDAC_CFG            */
#define VDAC_CFG_DBGHALT_HALT                   (_VDAC_CFG_DBGHALT_HALT << 27)          /**< Shifted mode HALT for VDAC_CFG              */
#define _VDAC_CFG_WARMUPTIME_SHIFT              28                                      /**< Shift value for VDAC_WARMUPTIME             */
#define _VDAC_CFG_WARMUPTIME_MASK               0x70000000UL                            /**< Bit mask for VDAC_WARMUPTIME                */
#define _VDAC_CFG_WARMUPTIME_DEFAULT            0x00000002UL                            /**< Mode DEFAULT for VDAC_CFG                   */
#define VDAC_CFG_WARMUPTIME_DEFAULT             (_VDAC_CFG_WARMUPTIME_DEFAULT << 28)    /**< Shifted mode DEFAULT for VDAC_CFG           */
#define VDAC_CFG_OUTENPRS                       (0x1UL << 31)                           /**< PRS Controlled Output Enable                */
#define _VDAC_CFG_OUTENPRS_SHIFT                31                                      /**< Shift value for VDAC_OUTENPRS               */
#define _VDAC_CFG_OUTENPRS_MASK                 0x80000000UL                            /**< Bit mask for VDAC_OUTENPRS                  */
#define _VDAC_CFG_OUTENPRS_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for VDAC_CFG                   */
#define _VDAC_CFG_OUTENPRS_DISOUTENPRS          0x00000000UL                            /**< Mode DISOUTENPRS for VDAC_CFG               */
#define _VDAC_CFG_OUTENPRS_ENOUTENPRS           0x00000001UL                            /**< Mode ENOUTENPRS for VDAC_CFG                */
#define VDAC_CFG_OUTENPRS_DEFAULT               (_VDAC_CFG_OUTENPRS_DEFAULT << 31)      /**< Shifted mode DEFAULT for VDAC_CFG           */
#define VDAC_CFG_OUTENPRS_DISOUTENPRS           (_VDAC_CFG_OUTENPRS_DISOUTENPRS << 31)  /**< Shifted mode DISOUTENPRS for VDAC_CFG       */
#define VDAC_CFG_OUTENPRS_ENOUTENPRS            (_VDAC_CFG_OUTENPRS_ENOUTENPRS << 31)   /**< Shifted mode ENOUTENPRS for VDAC_CFG        */

